Revit 2026 API

# FaceNode Class

---

An output node that represents a Face.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBFaceNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceNode : RenderNode
```
```vb
Public Class FaceNode
	Inherits RenderNode
```
```cpp
public ref class FaceNode : public RenderNode
```
```fsharp
type FaceNode =
    class
        inherit RenderNode
    end
```

The FaceNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFace | Returns the Face object corresponding to the node. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

See also: [!:Autodesk::Revit::DB::IExportContext::OnFaceBegin].

#### Reference

Autodesk.Revit.DB Namespace